WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_calc_freq_dc.c
  meadow_calc_freq_dc_enable(timerBase);
  return OK;
}

//=============================================================
// Called to unconfigure timer
// Timer numbers range from 1 - 14. However, some are not defined because they
// aren't available to Meadow.
int meadow_calc_freq_dc_freq_duty_unconfig(const uint32_t timerNumber)
{
  // Is this timer doing frequency measurements?
  struct freqDcTimerInfo_s *freqDcTimerInfo =
            meadow_calc_freq_dc_get_timer_info_pointer(timerNumber);

  // Is this slot being used?
  if(freqDcTimerInfo->freqDcRtData == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Can't unconfigure, no timer %lu.\n",
              __FILE__, __LINE__, timerNumber);
    return -EBADSLT;    // Invalid slot
  }

  // Stop interrupts
  up_disable_irq(freqDcTimerInfo->timerIrqVec);

  // Stop timer
  meadow_calc_freq_dc_disable(freqDcTimerInfo->timerBase);

  // Unconfigure GPIO
  stm32_unconfiggpio(freqDcTimerInfo->freqDcRtData->inputConfig);

  free(freqDcTimerInfo->freqDcRtData);
  freqDcTimerInfo->freqDcRtData = NULL;
  return OK;
}

//================================================================
// Return Frequency and Duty Cycle infomation to mono
int meadow_calc_freq_dc_mono_freq_duty_cycle(struct freqDcReturnData_s *returnData)
{
  // These insure that once a valid value is found, a change in the timer's
  // data structure won't affect the output.
  uint32_t completeCycle;
  uint32_t firstHalfCycle;
  uint32_t validCheckCount = 0;

  // Use timer number to find the information to return
  struct freqDcTimerInfo_s *freqDcTimerInfo = 
            meadow_calc_freq_dc_get_timer_info_pointer(returnData->timerNumber);
  if(freqDcTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Timer not configured\n", __FILE__, __LINE__);
    return -ENXIO;      // Unconfigured timer for this feature
  }

  // Is there an object here?
  if(freqDcTimerInfo->freqDcRtData == NULL)
  {
    syslog(LOG_ERR, "%s@%d-No timer assigned\n", __FILE__, __LINE__);
    return -ENODATA;      // No timer initialized
  }

  // Find valid data. This is only an issue at higher frequencies.
  for(validCheckCount = 0;\
      validCheckCount < MEADOW_FREQ_DC_READ_GOOD_DATA_ATTEMPTS;
      validCheckCount++)
  {
    completeCycle  = freqDcTimerInfo->freqDcRtData->countLeadToLead;
    firstHalfCycle = freqDcTimerInfo->freqDcRtData->countLeadToTrail;

    if(completeCycle > 0 && firstHalfCycle > 0)
      break;      // Found valid data, exit

    usleep(1 * 1000);   // delay 1-2 ms waiting for valid data
  }

  if(completeCycle > 0 && firstHalfCycle > 0)
  {
    // Do floating point math for calculations to get better resolution.
    double dutyCycle = (double)(firstHalfCycle * 100.0) / (double)completeCycle;
    double freq = (double)(MEADOW_FREQ_DC_CLOCK_FREQ)/ \
              (double)completeCycle;

    returnData->freqX1000       = (uint32_t)(freq * 1000.0);
    returnData->dutyCycleX1000  = (uint32_t)(dutyCycle * 1000.0);
  }
  else
  {
    // Return 0s as no data available
    returnData->freqX1000       = 0;
    returnData->dutyCycleX1000  = 0;
  }

  // Prevent this count from being reused if there's no input.
  freqDcTimerInfo->freqDcRtData->countLeadToLead   = 0;
  freqDcTimerInfo->freqDcRtData->countLeadToTrail  = 0;

  return OK;
}

//=========================================================================
// This ISR is called for all frequency with duty cycle interrupts.
// Note: I've user rising and falling here, instead of leading and falling to
// simplify the concept behind this code, instead of leading and trailing.
//
// On the first rising edge of the input, the timer clears the CNT count and
// CNT begins counting up.
// On the following falling edge, the timer copies the CNT value into CCR2.
// On the next rising edge, the timer copies the CNT value into CCR1 and CNT
// is again cleared to zero and the process repeats.
// This means that we must save the CCR1 and CCR2 timer values between the
// rising edge and the falling edge.
// For 16-bit timers, this is more complex because we must maintain a count
// for each CNT overflow interrupt. This allows us to maintain a 32-bit value.
// For CCR1 overflow for the entire period but for CCR2 only between the
// rising edge and the falling edge.
// Note: a 16-bit register at 96 MHz will overflow every 683 microseconds.
int meadow_calc_freq_dc_isr(int irq, void *context, void *arg)
{
  if(! configCompleted)
    return OK;

  struct freqDcTimerInfo_s *freqDcTimerInfo = (struct freqDcTimerInfo_s *)arg;
  struct freqDcRtData_s *freqDcRtData =
            (struct freqDcRtData_s *)freqDcTimerInfo->freqDcRtData;

  uint32_t timerBase = freqDcTimerInfo->timerBase;
  uint16_t timStatusReg = getreg16(timerBase + STM32_GTIM_SR_OFFSET);

  if(freqDcRtData == NULL)
  {
    syslog(1, "%s@%d-freqDcRtData is NULL in ISR\n", __FILE__, __LINE__);
    return -1;
  }

  syslog(1, "%s@%d-D06 LED on Entered ISR\n", __FILE__, __LINE__);

  stm32_gpiowrite(DEBUG_PIN_V2_D06, true);

  // The Problem with 16-bit timers.
  // At certain input frequencies the CNT being cleared and the CNT overflow
  // are reported in the same interrupt. However, there is only 1 bit available
  // to indicate both conditions.
  // The highest frequency this occurs at is TimerClock/65536, which is
  // 1,464.844 Hz with a timer clock of 96 MHz. This reoccurs at the intervals
  // (TimerClock/65536)/2, (TimerClock/65536)/3 etc.
  // More details.
  // For most input frequencies, on a leading (e.g. rising) or trailing (e.g.
  // falling) edge an interrupt is generated containing the CC1IF (leading) or
  // CC2IF (trailing) flags set. The UIF flag is always set with the CC1IF
  // flag, to indicate that the CNT register has been cleared. However, at
  // some frequencies, the overflow and the CNT reset occur at the same moment.
  // The UIF is set but it cannot be determined if it indicates CNT overflow or
  // CNT reset.
  switch(timStatusReg & 0x0007)
  {
    case 0x00:    // Nothing happened, just ignore
      break;

    //------------------------------------------------------------
    case 0x01:    // Lone UIF flag. CNT register changed, either reset or overflow)
      timStatusReg &= ~GTIM_SR_UIF;

      // Add to Leading to leading overflow
      freqDcRtData->LeadToLeadOverFlow++;
      break;

    //------------------------------------------------------------
    // Leading Edge
    case 0x02:    // Lone leading edge, never expected
      timStatusReg &= ~GTIM_SR_CC1IF;
      freqDcRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;
      break;

    case 0x03:     // Leading edge + UIF (Normal for End/Start of capture)
      timStatusReg &= ~GTIM_SR_UIF;   // Could be overflow or CNT reset
      timStatusReg &= ~GTIM_SR_CC1IF; // Leading edge should be CNT reset

      if(freqDcTimerInfo->timerWidth == MEADOW_FREQ_DC_WIDTH_32)
      {
        // At this point we expect to have seen a trailing edge and no errors
        if(freqDcRtData->activeState == MEADOW_FREQ_DC_FREQ_DC_SYNC_TRAILING)
        {
          // Save values
          freqDcRtData->countLeadToLead = getreg32(timerBase + STM32_GTIM_CCR1_OFFSET);
          freqDcRtData->countLeadToTrail = getreg32(timerBase + STM32_GTIM_CCR2_OFFSET);
        }
        else
        {
          freqDcRtData->countLeadToLead = 0;
          freqDcRtData->countLeadToTrail = 0;
        }

        freqDcRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_LEADING;
        break;
      }

      // Must be 16-bit timer
      uint32_t count1;
      uint32_t count2;

      if(freqDcRtData->activeState == MEADOW_FREQ_DC_FREQ_DC_SYNC_TRAILING)
      {
        // Save values
        count1 = getreg16(timerBase + STM32_GTIM_CCR1_OFFSET);
        count2 = getreg16(timerBase + STM32_GTIM_CCR2_OFFSET);

